import pytest


# Проверки для карт
@pytest.fixture
def valid_card_number_list():
    return [
        ("1234567890125678", "1234 56** **** 5678"),
        ("4762447890121121", "4762 44** **** 1121"),
        ("6765887890122255", "6765 88** **** 2255"),
    ]


@pytest.fixture
def invalid_card_number_list():
    return [
        ("", "Передана пустая строка"),
        ("1234abcd12345678", "Номер карты должен содержать только цифры"),
        ("123456781234567", "Номер карты должен содержать ровно 16 цифр"),
        ("12345678123456789", "Номер карты должен содержать ровно 16 цифр"),
    ]


# Проверки для аккаунта
@pytest.fixture
def valid_acc_number_list():
    return [
        ("73654108430135874305", "**4305"),
        ("73654108430135872701", "**2701"),
        ("73654108430135875653", "**5653"),
    ]


@pytest.fixture
def invalid_acc_number_list():
    return [
        ("", "Передана пустая строка"),
        ("73654abc108430135874305", "Номер аккаунта должен содержать только цифры"),
        ("73654108430135", "Номер аккаунта должен содержать ровно 20 цифр"),
        ("73654108430135874305123", "Номер аккаунта должен содержать ровно 20 цифр")
    ]
