import pytest


# Проверки для карт
@pytest.fixture
def valid_card_number_list():
    return [
        ("1234567890125678", "1234 56** **** 5678"),
        ("4762447890121121", "4762 44** **** 1121"),
        ("6765887890122255", "6765 88** **** 2255"),
    ]


@pytest.fixture
def invalid_card_number_list():
    return [
        ("", "Передана пустая строка"),
        ("1234abcd12345678", "Номер карты должен содержать только цифры"),
        ("123456781234567", "Номер карты должен содержать ровно 16 цифр"),
        ("12345678123456789", "Номер карты должен содержать ровно 16 цифр"),
    ]


# Проверки для аккаунта
@pytest.fixture
def valid_acc_number_list():
    return [
        ("73654108430135874305", "**4305"),
        ("73654108430135872701", "**2701"),
        ("73654108430135875653", "**5653"),
    ]


@pytest.fixture
def invalid_acc_number_list():
    return [
        ("", "Передана пустая строка"),
        ("73654abc108430135874305", "Номер аккаунта должен содержать только цифры"),
        ("73654108430135", "Номер аккаунта должен содержать ровно 20 цифр"),
        ("73654108430135874305123", "Номер аккаунта должен содержать ровно 20 цифр")
    ]


# Проверки для state
@pytest.fixture
def sort_by_state_value():
    return ((
                [
                    {"id": 41428829, "state": "EXECUTED", "date": "2019-07-03T18:35:29.512364"},
                    {"id": 939719570, "state": "EXECUTED", "date": "2018-06-30T02:08:58.425572"},
                    {"id": 594226727, "state": "CANCELED", "date": "2018-09-12T21:27:25.241689"},
                    {"id": 615064591, "state": "CANCELED", "date": "2018-10-14T08:21:33.419441"},
                ],
                "EXECUTED",
                [
                    {"id": 41428829, "state": "EXECUTED", "date": "2019-07-03T18:35:29.512364"},
                    {"id": 939719570, "state": "EXECUTED", "date": "2018-06-30T02:08:58.425572"},
                ]
            ),
            (
                [
                    {"id": 41428829, "state": "EXECUTED", "date": "2019-07-03T18:35:29.512364"},
                    {"id": 939719570, "state": "EXECUTED", "date": "2018-06-30T02:08:58.425572"},
                    {"id": 594226727, "state": "CANCELED", "date": "2018-09-12T21:27:25.241689"},
                    {"id": 615064591, "state": "CANCELED", "date": "2018-10-14T08:21:33.419441"},
                ],
                "CANCELED",
                [
                    {"id": 594226727, "state": "CANCELED", "date": "2018-09-12T21:27:25.241689"},
                    {"id": 615064591, "state": "CANCELED", "date": "2018-10-14T08:21:33.419441"},
                ]
            )
    )


@pytest.fixture
def sort_by_date_value():
    return ((
                [
                    {"id": 1, "date": "2024-01-01T00:00:00"},
                    {"id": 2, "date": "2023-01-01T00:00:00"},
                    {"id": 3, "date": "2022-01-01T00:00:00"},
                ],
                True,
                [
                    {"id": 1, "date": "2024-01-01T00:00:00"},
                    {"id": 2, "date": "2023-01-01T00:00:00"},
                    {"id": 3, "date": "2022-01-01T00:00:00"},
                ]
            ),
            (
                [
                    {"id": 1, "date": "2024-01-01T00:00:00"},
                    {"id": 2, "date": "2023-01-01T00:00:00"},
                    {"id": 3, "date": "2022-01-01T00:00:00"},
                ],
                False,
                [
                    {"id": 3, "date": "2022-01-01T00:00:00"},
                    {"id": 2, "date": "2023-01-01T00:00:00"},
                    {"id": 1, "date": "2024-01-01T00:00:00"},
                ]
            ),
            (
                [
                    {"id": 1, "date": "2024-01-01T00:00:00"},
                    {"id": 2, "date": "2024-01-01T00:00:00"},
                    {"id": 3, "date": "2024-01-01T00:00:00"},
                ],
                True,
                [
                    {"id": 1, "date": "2024-01-01T00:00:00"},
                    {"id": 2, "date": "2024-01-01T00:00:00"},
                    {"id": 3, "date": "2024-01-01T00:00:00"},
                ]
            ),
            (
                [
                    {"id": 1, "date": "2024-01-01T00:00:00"},
                    {"id": 2, "date": "2024-01-01T00:00:00"},
                    {"id": 3, "date": "2024-01-01T00:00:00"},
                ],
                False,
                [
                    {"id": 1, "date": "2024-01-01T00:00:00"},
                    {"id": 2, "date": "2024-01-01T00:00:00"},
                    {"id": 3, "date": "2024-01-01T00:00:00"},
                ]
            ),
            (
                [
                    {"id": 1, "date": "01-01-2024T00:00:00"},
                    {"id": 2, "date": "01-01-2023T00:00:00"},
                    {"id": 3, "date": "01-01-2022T00:00:00"},
                ],
                True,
                [
                    {"id": 1, "date": "01-01-2024T00:00:00"},
                    {"id": 2, "date": "01-01-2023T00:00:00"},
                    {"id": 3, "date": "01-01-2022T00:00:00"},
                ]
            ),
            (
                [
                    {"id": 1, "date": "01-01-2024T00:00:00"},
                    {"id": 2, "date": "01-01-2023T00:00:00"},
                    {"id": 3, "date": "01-01-2022T00:00:00"},
                ],
                False,
                [
                    {"id": 3, "date": "01-01-2022T00:00:00"},
                    {"id": 2, "date": "01-01-2023T00:00:00"},
                    {"id": 1, "date": "01-01-2024T00:00:00"},
                ]
            )
    )
