import pytest


# Проверки для карт
@pytest.fixture
def valid_card_number_list() -> list:
    return [
        ("1234567890125678", "1234 56** **** 5678"),
        ("4762447890121121", "4762 44** **** 1121"),
        ("6765887890122255", "6765 88** **** 2255"),
    ]


@pytest.fixture
def invalid_card_number_list() -> list:
    return [
        ("", "Передана пустая строка"),
        ("1234abcd12345678", "Номер карты должен содержать только цифры"),
        ("123456781234567", "Номер карты должен содержать ровно 16 цифр"),
        ("12345678123456789", "Номер карты должен содержать ровно 16 цифр"),
    ]


# Проверки для аккаунта
@pytest.fixture
def valid_acc_number_list() -> list:
    return [
        ("73654108430135874305", "**4305"),
        ("73654108430135872701", "**2701"),
        ("73654108430135875653", "**5653"),
    ]


@pytest.fixture
def invalid_acc_number_list() -> list:
    return [
        ("", "Передана пустая строка"),
        ("73654abc108430135874305", "Номер аккаунта должен содержать только цифры"),
        ("73654108430135", "Номер аккаунта должен содержать ровно 20 цифр"),
        ("73654108430135874305123", "Номер аккаунта должен содержать ровно 20 цифр"),
    ]


# Проверки для state
@pytest.fixture
def sort_by_state_value() -> tuple:
    return (
        (
            [
                {"id": 41428829, "state": "EXECUTED", "date": "2019-07-03T18:35:29.512364"},
                {"id": 939719570, "state": "EXECUTED", "date": "2018-06-30T02:08:58.425572"},
                {"id": 594226727, "state": "CANCELED", "date": "2018-09-12T21:27:25.241689"},
                {"id": 615064591, "state": "CANCELED", "date": "2018-10-14T08:21:33.419441"},
            ],
            "EXECUTED",
            [
                {"id": 41428829, "state": "EXECUTED", "date": "2019-07-03T18:35:29.512364"},
                {"id": 939719570, "state": "EXECUTED", "date": "2018-06-30T02:08:58.425572"},
            ],
        ),
        (
            [
                {"id": 41428829, "state": "EXECUTED", "date": "2019-07-03T18:35:29.512364"},
                {"id": 939719570, "state": "EXECUTED", "date": "2018-06-30T02:08:58.425572"},
                {"id": 594226727, "state": "CANCELED", "date": "2018-09-12T21:27:25.241689"},
                {"id": 615064591, "state": "CANCELED", "date": "2018-10-14T08:21:33.419441"},
            ],
            "CANCELED",
            [
                {"id": 594226727, "state": "CANCELED", "date": "2018-09-12T21:27:25.241689"},
                {"id": 615064591, "state": "CANCELED", "date": "2018-10-14T08:21:33.419441"},
            ],
        ),
    )


@pytest.fixture
def sort_by_date_value() -> tuple:
    return (
        (
            [
                {"id": 41428829, "state": "EXECUTED", "date": "2019-07-03T18:35:29.512364"},
                {"id": 939719570, "state": "EXECUTED", "date": "2018-06-30T02:08:58.425572"},
                {"id": 594226727, "state": "CANCELED", "date": "2018-09-12T21:27:25.241689"},
                {"id": 615064591, "state": "CANCELED", "date": "2018-10-14T08:21:33.419441"},
            ],
            False,
            [
                {"id": 939719570, "state": "EXECUTED", "date": "2018-06-30T02:08:58.425572"},
                {"id": 594226727, "state": "CANCELED", "date": "2018-09-12T21:27:25.241689"},
                {"id": 615064591, "state": "CANCELED", "date": "2018-10-14T08:21:33.419441"},
                {"id": 41428829, "state": "EXECUTED", "date": "2019-07-03T18:35:29.512364"},
            ],
        ),
        (
            [
                {"id": 123456789, "state": "EXECUTED", "date": "2020-01-15T10:45:30.123456"},
                {"id": 987654321, "state": "EXECUTED", "date": "2019-05-22T14:30:45.654321"},
                {"id": 555555555, "state": "CANCELED", "date": "2019-08-10T19:55:20.987654"},
                {"id": 444444444, "state": "CANCELED", "date": "2019-11-25T07:15:40.321654"},
            ],
            True,
            [
                {"id": 123456789, "state": "EXECUTED", "date": "2020-01-15T10:45:30.123456"},
                {"id": 444444444, "state": "CANCELED", "date": "2019-11-25T07:15:40.321654"},
                {"id": 555555555, "state": "CANCELED", "date": "2019-08-10T19:55:20.987654"},
                {"id": 987654321, "state": "EXECUTED", "date": "2019-05-22T14:30:45.654321"},
            ],
        ),
    )


# Проверки для транзакций
@pytest.fixture
def transactions():
    return [
        {
            "id": 939719570,
            "state": "EXECUTED",
            "date": "2018-06-30T02:08:58.425572",
            "operationAmount": {
                "amount": "9824.07",
                "currency": {
                    "name": "USD",
                    "code": "USD"
                }
            },
            "description": "Перевод организации",
            "from": "Счет 75106830613657916952",
            "to": "Счет 11776614605963066702"
        },
        {
            "id": 142264268,
            "state": "EXECUTED",
            "date": "2019-04-04T23:20:05.206878",
            "operationAmount": {
                "amount": "79114.93",
                "currency": {
                    "name": "RUB",
                    "code": "USD"
                }
            },
            "description": "Перевод со счета на счет",
            "from": "Счет 19708645243227258542",
            "to": "Счет 75651667383060284188"
        }
    ]
